ССЫЛКА НА ИСТОЧНИК ЗАДАЧ: https://karpov.courses/simulator-sql

<b>Задача 1</b>

Выведите все записи из таблицы products.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT *
FROM products as p

<b>Задача 2</b>

Выведите все записи из таблицы products, отсортировав их по наименованиям товаров в алфавитном порядке, т.е. по возрастанию.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT *
FROM products as p
ORDER BY p.name

<b>Задача 3</b>

Отсортируйте таблицу courier_actions сначала по колонке courier_id по возрастанию id курьера, потом по колонке action, а затем по колонке time, но уже по убыванию — от самого последнего действия к самому первому.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: courier_id, order_id, action, time

In [ ]:
SELECT *
FROM courier_actions as ca
ORDER BY ca.courier_id, ca.action, ca.time DESC
LIMIT 1000

<b>Задача 4</b>

Используя операторы SELECT, FROM, ORDER BY и LIMIT, определите 5 самых дорогих товаров в таблице products, которые доставляет наш сервис. Выведите их наименования и цену.

Поля в результирующей таблице: name, price

In [ ]:
SELECT p.name, p.price
FROM products as p
ORDER BY p.price DESC
LIMIT 5

<b>Задача 5</b>

Повторите запрос из предыдущего задания, но теперь колонки name и price переименуйте соответственно в product_name и product_price.

Поля в результирующей таблице: product_name, product_price

In [ ]:
SELECT p.name as product_name, p.price as product_price
FROM products as p
ORDER BY p.price DESC
LIMIT 5

<b>Задача 6</b>

Используя операторы SELECT, FROM, ORDER BY и LIMIT, а также функцию LENGTH, определите товар с самым длинным названием в таблице products. Выведите его наименование, длину наименования в символах, а также цену этого товара. Колонку с длиной наименования в символах назовите name_length.

Поля в результирующей таблице: name, name_length, price

In [ ]:
SELECT p.name,
       length(p.name) as name_length,
       p.price
FROM   products as p
ORDER BY 2 desc
LIMIT 1

<b>Задача 7</b>

Примените последовательно функции UPPER и SPLIT_PART к колонке name и преобразуйте наименования товаров в таблице products так, чтобы от названий осталось только первое слово, записанное в верхнем регистре. Колонку с новым названием, состоящим из первого слова, назовите first_word.

В результат включите исходные наименования товаров, новые наименования из первого слова, а также цену товаров. Результат отсортируйте по возрастанию исходного наименования товара в колонке name.

Поля в результирующей таблице: name, first_word, price

In [ ]:
SELECT p.name,
       UPPER(SPLIT_PART(p.name, ' ', 1)) as first_word,
       p.price
FROM products as p
ORDER BY p.name

<b>Задача 8</b>

Измените тип колонки price из таблицы products на VARCHAR. Выведите колонки с наименованием товаров, ценой в исходном формате и ценой в формате VARCHAR. Новую колонку с ценой в новом формате назовите price_char.

Результат отсортируйте по возрастанию исходного наименования товара в колонке name. Количество выводимых записей не ограничивайте.

Поле в результирующей таблице: name, price, price_char

In [ ]:
SELECT p.name,
       p.price,
       p.price::VARCHAR as price_char
FROM products as p
ORDER BY p.name

<b>Задача 9</b>

Для первых 200 записей из таблицы orders выведите информацию в следующем виде (обратите внимание на пробелы):

Заказ № [id_заказа] создан [дата]

Полученную колонку назовите order_info.

In [ ]:
SELECT CONCAT('Заказ № ', o.order_id, ' создан ', o.creation_time::DATE) as order_info
FROM orders as o
LIMIT 200

<b>Задача 10</b>

Выведите id всех курьеров и их годы рождения из таблицы couriers.

Год рождения необходимо получить из колонки birth_date. Новую колонку с годом назовите birth_year. Результат отсортируйте сначала по убыванию года рождения курьера (т.е. от самых младших к самым старшим), затем по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_year

In [ ]:
SELECT c.courier_id,
       DATE_PART('YEAR', c.birth_date) as birth_year
FROM couriers as c
ORDER BY 2 DESC, 1

<b>Задача 11</b>

Как и в предыдущем задании, снова выведите id всех курьеров и их годы рождения, только теперь к извлеченному году примените функцию COALESCE. Укажите параметры функции так, чтобы вместо NULL значений в результат попадало текстовое значение unknown. Названия полей оставьте прежними.

Отсортируйте итоговую таблицу сначала по убыванию года рождения курьера, затем по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_year

In [ ]:
SELECT c.courier_id,
       COALESCE(DATE_PART('YEAR', c.birth_date)::varchar, 'unknown') as birth_year
FROM couriers as c
ORDER BY 2 DESC, 1

<b>Задача 12</b>

Давайте представим, что по какой-то необъяснимой причине мы вдруг решили в одночасье повысить цену всех товаров в таблице products на 5%.

Выведите id и наименования всех товаров, их старую и новую цену. Колонку со старой ценой назовите old_price, а колонку с новой — new_price.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       p.price * 1.05 as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 13</b>

Вновь, как и в прошлом задании, повысьте цену всех товаров на 5%, только теперь к колонке с новой ценой примените функцию ROUND. Выведите id и наименования товаров, их старую цену, а также новую цену с округлением. Новую цену округлите до одного знака после запятой, но тип данных не меняйте.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       ROUND(p.price * 1.05, 1) as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 14</b>

Повысьте цену на 5% только на те товары, цена которых превышает 100 рублей. Цену остальных товаров оставьте без изменений. Также не повышайте цену на икру, которая и так стоит 800 рублей. Выведите id и наименования всех товаров, их старую и новую цену. Цену округлять не нужно.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       CASE
       WHEN p.price > 100 AND p.name != 'икра' THEN p.price * 1.05
       ELSE p.price END as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 15</b>

Вычислите НДС каждого товара в таблице products и рассчитайте цену без учёта НДС. Выведите всю информацию о товарах, включая сумму налога и цену без его учёта. Колонки с суммой налога и ценой без НДС назовите соответственно tax и price_before_tax. Округлите значения в этих колонках до двух знаков после запятой.

Результат отсортируйте сначала по убыванию цены товара без учёта НДС, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, tax, price_before_tax

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       ROUND(p.price / 120 * 20, 2) as tax,
       ROUND(p.price - p.price / 120 * 20, 2) as price_before_tax
FROM products as p
ORDER BY 5 DESC, 1